Modules/Vmeta/README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Vmeta module for Youtoo 0.93</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="Updated February 2010"/>
<meta name="author" content="T. Kurt Bond"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Vmeta module for Youtoo 0.93</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright </a></li>
<li><a href="#sec-2">2 EuLisp index </a></li>
<li><a href="#sec-3">3 General Description </a></li>
<li><a href="#sec-4">4 Installation </a></li>
<li><a href="#sec-5">5 Files </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="COPYING">Copyright</a> </h2>
<div class="outline-text-2" id="text-1">

<p>Youtoo is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 2 of the License, or
(at your option) any later version.
</p>
<p>
Youtoo is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
for more details.
</p>
<p>
You should have received a copy of the GNU General Public License along with
Youtoo in the file <a href="../../COPYING">COPYING</a>.  If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="../../index.html">EuLisp index</a> </h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Description </h2>
<div class="outline-text-2" id="text-3">

<p>This code was inspired by Henry G. Baker's article:
"Pragmatic Parsing in Common Lisp",
ACM LISP Pointers IV,2
(April-June 1991), 3-15.
</p>
<p>
However, any errors are mine; inefficencies too.  There have been some minor
changes and additions from the code in that article.
</p>
<p>
<a href="http://home.pipeline.com/~hbaker1">Original paper</a>
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Installation </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>
Run 'make' in directory <i>Extras/Vmeta</i>.
</li>
<li>
Run 'make test' in directory <i>Extras/Vmeta</i>.
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Files </h2>
<div class="outline-text-2" id="text-5">

<p>The pipe library consists of single EuLisp module:
</p><ul>
<li>
<i>vmeta.em</i> &ndash; root module

</li>
</ul>

<p>which uses the syntax operators in <i>vmeta-aux.em</i>
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: T. Kurt Bond
</p>
<p class="date"> Date: Updated February 2010</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 23</p>
</div>
</div>
</body>
</html>
